{
  "Pages": {
    "TermsOfUse": {
      "meta": {
        "title": "Agrofast - Términos de Uso",
        "description": "Términos de Uso de Agrofast"
      },
      "content": {
        "main_title": "TÉRMINOS DE USO DE LA APLICACIÓN “AGROFAST”",
        "section_1": {
          "title": "1. INTRODUCCIÓN Y ACEPTACIÓN",
          "paragraph_1": "Bienvenido(a) a “AgroFast”, una plataforma que conecta a propietarios(as) de maquinaria agrícola con conductores de camiones de plataforma, facilitando la negociación y el transporte seguro de maquinarias pesadas.",
          "paragraph_2": "Estos Términos de Uso (“Términos”) tienen como objetivo regular las condiciones para utilizar la aplicación “AgroFast” (en adelante “Aplicación”). Al utilizar nuestro servicio, el usuario declara haber leído, comprendido y aceptado plenamente estos Términos."
        },
        "section_2": {
          "title": "2. ELEGIBILIDAD",
          "paragraph_1": "Para utilizar la Aplicación, el usuario debe tener plena capacidad civil conforme a la legislación brasileña y no puede estar legalmente impedido de contratar o realizar actos de la vida civil.",
          "paragraph_2": "Los menores de 18 años solo pueden utilizar “AgroFast” si están debidamente representados o asistidos por un responsable legal."
        },
        "section_3": {
          "title": "3. REGISTRO Y RESPONSABILIDAD DEL USUARIO",
          "paragraph_1": "El registro en la Aplicación requiere proporcionar información verídica y completa, como nombre completo, dirección de correo electrónico, teléfono, entre otros. El usuario es responsable de la veracidad y actualidad de los datos proporcionados.",
          "paragraph_2": "Cada usuario es responsable de salvaguardar la confidencialidad de sus credenciales de acceso (login y contraseña). Todas las actividades realizadas con el uso de dichas credenciales serán responsabilidad exclusiva del titular de la cuenta."
        },
        "section_4": {
          "title": "4. CONDUCTA Y USO ADECUADO",
          "paragraph_1": "Respeto y Civilidad: Está estrictamente prohibido adoptar comportamientos discriminatorios, ofensivos, abusivos, difamatorios, amenazantes o que violen los derechos humanos y la dignidad de las personas. Los usuarios deben mantener la cordialidad y el respeto mutuo durante toda la experiencia en la Aplicación.",
          "paragraph_2": "Actos Ilícitos: Se prohíbe cualquier práctica contraria a las leyes y reglamentos vigentes, incluyendo, pero no limitado a, fraudes, violaciones de propiedad intelectual, comunicación de contenido ilegal o difamatorio y uso indebido de la Aplicación con fines delictivos.",
          "paragraph_3": "Armonía en las Relaciones: Los usuarios (tanto propietarios(as) de maquinaria agrícola como conductores) deben comprometerse a:",
          "paragraph_4": "4.3.1. Tratar a todos con empatía, sin usar discurso de odio, discriminación o acoso.\n4.3.2. Mantener la integridad en la provisión de información sobre vehículos, maquinarias, rutas y valores de transporte.\n4.3.3. Asegurar que las actividades de transporte cumplan con las normas legales (por ejemplo, límites de peso, dimensiones y licencias específicas)."
        },
        "section_5": {
          "title": "5. PAGOS Y TARIFAS",
          "paragraph_1": "“AgroFast” puede poner a disposición de los usuarios funcionalidades de pago y cobro por el transporte de maquinaria. Las eventuales tarifas, así como las formas de pago, estarán descritas en la plataforma o en los canales de soporte.",
          "paragraph_2": "El usuario se compromete a pagar todos los importes adeudados por la prestación del servicio al/los conductor(es) respectivo(s) o propietario(s) de maquinaria, de acuerdo con las reglas establecidas en la Aplicación."
        },
        "section_6": {
          "title": "6. PROPIEDAD INTELECTUAL",
          "paragraph_1": "Los derechos de propiedad intelectual relacionados con marcas, logotipos, nombres de dominio, diseño y cualquier otro signo distintivo de “AgroFast” pertenecen al equipo responsable de la plataforma, sin que se otorgue ninguna licencia o autorización para su uso más allá de lo estrictamente necesario para el disfrute de los servicios ofrecidos.",
          "paragraph_2": "Está prohibido copiar, reproducir, modificar, crear obras derivadas, distribuir, publicar o, de cualquier forma, explotar el contenido de la Aplicación sin autorización previa y expresa de sus titulares."
        },
        "section_7": {
          "title": "7. PRIVACIDAD Y PROTECCIÓN DE DATOS",
          "paragraph_1": "El uso de “AgroFast” implica la lectura y aceptación de la Política de Privacidad, que explica los tipos de datos recopilados, los fines y cómo se tratan.",
          "paragraph_2": "Los usuarios se comprometen a utilizar los datos obtenidos a través de la Aplicación únicamente para los fines de comunicación y prestación de servicios descritos, cumpliendo la legislación, especialmente la Ley General de Protección de Datos (LGPD) de Brasil."
        },
        "section_8": {
          "title": "8. LIMITACIÓN DE RESPONSABILIDAD",
          "paragraph_1": "“AgroFast” actúa como intermediario entre propietarios(as) de maquinaria agrícola y conductores, sin ser responsable directamente de la ejecución del transporte, la calidad del servicio prestado o las acciones/omisiones de los usuarios.",
          "paragraph_2": "En la medida máxima permitida por la ley aplicable, “AgroFast” no será responsable de ningún daño, pérdida, lucro cesante o perjuicio resultante de retrasos, cancelaciones, accidentes o cualquier otro evento relacionado con la prestación del servicio de transporte."
        },
        "section_9": {
          "title": "9. INDEMNIZACIÓN",
          "paragraph_1": "El usuario se compromete a indemnizar y mantener a “AgroFast” libre de toda responsabilidad, reclamación, demanda, pérdida o gasto derivado de:",
          "paragraph_2": "9.1.1. Violación de estos Términos de Uso o de la legislación aplicable.\n9.1.2. Actividades ilícitas realizadas a través de su cuenta.\n9.1.3. Información falsa o engañosa proporcionada a “AgroFast” o a terceros en la plataforma."
        },
        "section_10": {
          "title": "10. MODIFICACIONES DE LOS TÉRMINOS",
          "paragraph_1": "“AgroFast” podrá alterar estos Términos en cualquier momento, con el fin de mejorar el servicio o adaptarlo a cambios legales. El usuario será notificado cuando se produzcan cambios relevantes. El uso continuo de la Aplicación después de la divulgación de tales cambios constituye la aceptación de los nuevos Términos."
        },
        "section_11": {
          "title": "11. DURACIÓN Y TERMINACIÓN",
          "paragraph_1": "Estos Términos estarán vigentes por tiempo indefinido, a partir de su aceptación por parte del usuario.",
          "paragraph_2": "Cualquiera de las partes podrá dar por terminada la relación en cualquier momento mediante la eliminación de la cuenta. No obstante, podrán subsistir obligaciones derivadas de hechos ocurridos antes de la terminación."
        },
        "section_12": {
          "title": "12. LEY APLICABLE Y JURISDICCIÓN",
          "paragraph_1": "Estos Términos se interpretarán de acuerdo con la legislación brasileña.",
          "paragraph_2": "Se elige el fuero del domicilio del usuario para resolver cualquier disputa derivada de estos Términos, salvo que la ley disponga lo contrario o exista un acuerdo expreso entre las partes."
        },
        "section_13": {
          "title": "13. DISPOSICIONES FINALES",
          "paragraph_1": "La eventual tolerancia de “AgroFast” con respecto al incumplimiento de cualquiera de las cláusulas de estos Términos no implica la renuncia al derecho de exigir su cumplimiento en un momento posterior.",
          "paragraph_2": "Si alguna disposición de este documento se considera inválida o inejecutable, las demás disposiciones permanecerán en pleno vigor y efecto.",
          "paragraph_3": "AL UTILIZAR “AGROFAST”, USTED RECONOCE QUE HA LEÍDO Y ACEPTA TODOS LOS TÉRMINOS ANTERIORES."
        }
      }
    },
    "PrivacyPolicies": {
      "meta": {
        "title": "Agrofast - Política de Privacidad",
        "description": "Política de Privacidad de Agrofast"
      },
      "content": {
        "main_title": "POLÍTICA DE PRIVACIDAD – APLICACIÓN “AGROFAST”",
        "section_1": {
          "title": "1. INFORMACIÓN GENERAL",
          "paragraph_1": "“AgroFast” conecta a propietarios(as) de maquinaria agrícola con conductores de camiones de plataforma, proporcionando programación flexible, negociación de tarifas, rutas optimizadas y otras funcionalidades descritas en nuestro Documento de Especificación de Requisitos de Software (DERS). Para brindar estos servicios de manera confiable, segura y eficiente, es esencial la recopilación y el procesamiento de ciertos datos personales."
        },
        "section_2": {
          "title": "2. DATOS RECOPILADOS",
          "subsections": {
            "subsection_2_1": {
              "subtitle": "2.1. Datos de Registro",
              "paragraph_1": "Información personal: nombre completo, dirección de correo electrónico, número de teléfono/celular.",
              "paragraph_2": "Credenciales de acceso: login y contraseña, necesarias para la autenticación en la aplicación."
            },
            "subsection_2_2": {
              "subtitle": "2.2. Datos de Perfil",
              "paragraph_1": "Perfil de Conductor: información sobre el vehículo (tipo de camión de plataforma), radio de servicio, disponibilidad, preferencias de transporte y cualquier anexo relacionado con licencias o permisos.",
              "paragraph_2": "Perfil de Propietario(a): detalles sobre la(s) maquinaria(s) agrícola(s) (dimensiones, peso aproximado, tipo de equipo)."
            },
            "subsection_2_3": {
              "subtitle": "2.3. Datos de Ubicación",
              "paragraph_1": "Ubicación en tiempo real (vía GPS) o ubicación aproximada del usuario, utilizada para indicar el lugar exacto de recogida/entrega de las máquinas, calcular rutas optimizadas y estimar costos."
            },
            "subsection_2_4": {
              "subtitle": "2.4. Datos de Pago y Transacciones",
              "paragraph_1": "Método de pago: datos necesarios para llevar a cabo la transacción (cuando haya integración de pago).",
              "paragraph_2": "Historial de transacciones: valores pagados, fechas, horas y detalles de cada viaje."
            },
            "subsection_2_5": {
              "subtitle": "2.5. Datos de Uso de la Aplicación",
              "paragraph_1": "Solicitudes de transporte: registros de cada solicitud (punto de partida, destino, dimensiones/peso de las máquinas, fecha y hora).",
              "paragraph_2": "Mensajes internos: contenido de las conversaciones intercambiadas a través del sistema de mensajería de la aplicación.",
              "paragraph_3": "Evaluaciones y comentarios: calificaciones y opiniones después de la finalización de los servicios."
            },
            "subsection_2_6": {
              "subtitle": "2.6. Datos de Notificaciones",
              "paragraph_1": "Tokens de notificación, recopilados para habilitar alertas en tiempo real sobre solicitudes, estado del transporte y pagos."
            },
            "subsection_2_7": {
              "subtitle": "2.7. Datos Técnicos",
              "paragraph_1": "Registros de errores y métricas de rendimiento, información del dispositivo (modelo, sistema operativo, versión de la aplicación, etc.) para diagnóstico y soporte."
            }
          }
        },
        "section_3": {
          "title": "3. FINALIDADES DEL TRATAMIENTO DE DATOS",
          "paragraph_1": "Prestación del servicio: permitir la conexión entre propietarios(as) y conductores, posibilitando el registro, la publicación de solicitudes, la definición de rutas y la facturación.",
          "paragraph_2": "Seguridad: prevenir fraudes, uso indebido de la aplicación y garantizar la autenticidad de los accesos.",
          "paragraph_3": "Optimización de rutas y cálculo de tarifas: uso de la ubicación y la información del viaje para estimar costos y rutas eficientes.",
          "paragraph_4": "Soporte y resolución de disputas: contacto con el equipo de soporte para resolver problemas y verificar servicios.",
          "paragraph_5": "Mejoras en el servicio: análisis de estadísticas, errores y métricas para mejorar las funcionalidades.",
          "paragraph_6": "Comunicación: envío de notificaciones y actualizaciones importantes.",
          "paragraph_7": "Cumplimiento de obligaciones legales: mantenimiento de registros fiscales y atención a solicitudes oficiales."
        },
        "section_4": {
          "title": "4. COMPARTICIÓN DE DATOS",
          "paragraph_1": "Entre usuarios(as): información básica para concretar el transporte (por ejemplo, lugar de recogida, detalles del camión).",
          "paragraph_2": "Proveedores de mapas: la ubicación y la información del viaje pueden compartirse con APIs de terceros (Google Maps, etc.) para la definición de rutas.",
          "paragraph_3": "Proveedores de pago: datos de cobro enviados a intermediarios financieros de confianza.",
          "paragraph_4": "Autoridades competentes: en caso de obligaciones legales, órdenes judiciales o investigaciones."
        },
        "section_5": {
          "title": "5. BASE LEGAL Y DERECHOS DE LOS USUARIOS",
          "paragraph_1": "La recopilación y el tratamiento de datos personales se basan en el consentimiento, el interés legítimo y/o el cumplimiento de una obligación legal.",
          "paragraph_2": "De conformidad con la legislación brasileña (LGPD), los usuarios tienen derecho a la confirmación del tratamiento de datos, acceso, corrección, anonimización, bloqueo o eliminación de datos, portabilidad, revocación del consentimiento, entre otros."
        },
        "section_6": {
          "title": "6. RETENCIÓN Y ELIMINACIÓN DE DATOS",
          "paragraph_1": "Los datos de registro se mantienen mientras haya una cuenta activa. En caso de eliminación, los datos pueden retenerse para cumplir con obligaciones legales.",
          "paragraph_2": "El historial de transacciones se almacena para fines de gestión y auditoría.",
          "paragraph_3": "Los mensajes, comentarios y evaluaciones pueden mantenerse para la verificación de reputación y la resolución de disputas."
        },
        "section_7": {
          "title": "7. MEDIDAS DE SEGURIDAD",
          "paragraph_1": "Cifrado (HTTPS) para proteger la información en tránsito.",
          "paragraph_2": "Almacenamiento seguro con controles de acceso físicos y lógicos.",
          "paragraph_3": "Política de contraseñas seguras y monitoreo de vulnerabilidades."
        },
        "section_8": {
          "title": "8. COOKIES Y TECNOLOGÍAS SIMILARES",
          "paragraph_1": "Pueden emplearse tecnologías de rastreo (cookies, identificadores de dispositivo) para mejorar la experiencia del usuario, recordar preferencias de idioma y optimizar el rendimiento."
        },
        "section_9": {
          "title": "9. ACTUALIZACIONES DE LA POLÍTICA",
          "paragraph_1": "Esta Política puede modificarse en cualquier momento para reflejar mejoras en el servicio o cambios legales. Los usuarios serán notificados de los cambios relevantes."
        },
        "section_10": {
          "title": "10. CONTACTO Y SOPORTE",
          "paragraph_1": "Las dudas, solicitudes o quejas deben dirigirse a los canales de soporte disponibles en la aplicación o al correo electrónico proporcionado a tal efecto."
        }
      }
    }
  }
}
