{
  "Pages": {
    "TermsOfUse": {
      "meta": {
        "title": "Agrofast - Termos de Uso",
        "description": "Termos de Uso da Agrofast"
      },
      "content": {
        "main_title": "TERMOS DE USO DA APLICAÇÃO “AGROFAST”",
        "section_1": {
          "title": "1. INTRODUÇÃO E ACEITAÇÃO",
          "paragraph_1": "Bem-vindo(a) ao “AgroFast”, uma plataforma que conecta proprietários(as) de máquinas agrícolas a motoristas de caminhões prancha, facilitando a negociação e o transporte seguro de maquinários pesados.",
          "paragraph_2": "Os presentes Termos de Uso (“Termos”) têm por objetivo regular as condições para utilização do aplicativo “AgroFast” (doravante “Aplicativo”). Ao fazer uso do nosso serviço, o usuário declara ter lido, compreendido e aceitado integralmente estes Termos."
        },
        "section_2": {
          "title": "2. ELEGIBILIDADE",
          "paragraph_1": "Para utilizar o Aplicativo, o usuário deve ter capacidade civil plena, nos termos da legislação brasileira, e não pode estar proibido de contratar ou exercer atos da vida civil.",
          "paragraph_2": "Menores de 18 anos somente poderão utilizar o “AgroFast” se devidamente representados ou assistidos por um(a) responsável legal."
        },
        "section_3": {
          "title": "3. CADASTRO E RESPONSABILIDADE DO USUÁRIO",
          "paragraph_1": "O cadastro no Aplicativo requer o fornecimento de informações verídicas e completas, como nome completo, endereço de e-mail, telefone, entre outras. O usuário é responsável pela veracidade e atualidade dos dados informados.",
          "paragraph_2": "Cada usuário é responsável por zelar pela confidencialidade de suas credenciais de acesso (login e senha). Quaisquer atividades realizadas com o uso dessas credenciais serão de responsabilidade exclusiva do titular da conta."
        },
        "section_4": {
          "title": "4. CONDUTA E USO ADEQUADO",
          "paragraph_1": "Respeito e Civilidade: É estritamente proibida a adoção de comportamento discriminatório, ofensivo, abusivo, difamatório, ameaçador ou que viole direitos humanos e a dignidade das pessoas. Os usuários devem manter a cordialidade e o respeito mútuo durante toda a experiência dentro do Aplicativo.",
          "paragraph_2": "Atos Ilícitos: É vedada qualquer prática contrária às leis e regulamentos vigentes, inclusive, mas não se limitando a, fraudes, violações de propriedade intelectual, comunicação de conteúdo ilegal ou difamatório e uso indevido do Aplicativo para fins criminosos.",
          "paragraph_3": "Harmonia das Relações: Os usuários (tanto proprietários(as) de máquinas agrícolas quanto motoristas) devem se comprometer a:",
          "paragraph_4": "4.3.1. Tratar todos com empatia, sem usar discurso de ódio, preconceituoso ou assédio.\n4.3.2. Manter a integridade no fornecimento de informações sobre veículos, maquinários, rotas e valores de transporte.\n4.3.3. Garantir que as atividades de transporte estejam de acordo com normas legais (por exemplo, limites de peso, dimensões e licenças específicas)."
        },
        "section_5": {
          "title": "5. PAGAMENTOS E TARIFAS",
          "paragraph_1": "O “AgroFast” pode disponibilizar aos usuários funcionalidades de pagamento e cobrança pelo transporte de maquinário. As eventuais tarifas, bem como as formas de pagamento, estarão descritas na plataforma ou nos canais de suporte.",
          "paragraph_2": "O usuário concorda em pagar todos os valores devidos pela prestação do serviço ao(s) respectivo(s) motorista(s) ou proprietário(a)(s) de maquinário, conforme regras estabelecidas no Aplicativo."
        },
        "section_6": {
          "title": "6. PROPRIEDADE INTELECTUAL",
          "paragraph_1": "Os direitos de propriedade intelectual relativos a marcas, logotipos, nomes de domínio, layout e qualquer outro sinal distintivo do “AgroFast” pertencem à equipe responsável pela plataforma, não sendo concedida qualquer licença ou autorização para uso além do estritamente necessário à fruição dos serviços oferecidos.",
          "paragraph_2": "É proibido copiar, reproduzir, modificar, criar obras derivadas, distribuir, publicar ou, de qualquer forma, explorar o conteúdo do Aplicativo sem a autorização prévia e expressa de seus detentores."
        },
        "section_7": {
          "title": "7. PRIVACIDADE E PROTEÇÃO DE DADOS",
          "paragraph_1": "A utilização do “AgroFast” implica na leitura e aceitação da Política de Privacidade, na qual são explicados os tipos de dados coletados, as finalidades e como são tratados.",
          "paragraph_2": "Os usuários se comprometem a utilizar os dados obtidos por meio do Aplicativo somente para os fins de comunicação e prestação de serviços previstos, respeitando a legislação, em especial a Lei Geral de Proteção de Dados (LGPD)."
        },
        "section_8": {
          "title": "8. LIMITAÇÃO DE RESPONSABILIDADE",
          "paragraph_1": "O “AgroFast” atua como intermediário entre proprietários(as) de máquinas agrícolas e motoristas, não possuindo responsabilidade direta pela execução do transporte, pela qualidade do serviço prestado ou pelas ações/omissões dos usuários.",
          "paragraph_2": "Na medida máxima permitida pela legislação aplicável, o “AgroFast” não será responsável por eventuais prejuízos, danos, perdas ou lucros cessantes resultantes de atrasos, cancelamentos, acidentes ou qualquer outro acontecimento relacionado à prestação do serviço de transporte."
        },
        "section_9": {
          "title": "9. INDENIZAÇÃO",
          "paragraph_1": "O usuário concorda em indenizar e isentar o “AgroFast” de quaisquer responsabilidades, reclamações, demandas, perdas ou despesas decorrentes de:",
          "paragraph_2": "9.1.1. Violação destes Termos de Uso ou da legislação aplicável.\n9.1.2. Atividades ilícitas praticadas por meio de sua conta.\n9.1.3. Informações falsas ou enganosas fornecidas ao “AgroFast” ou a terceiros na plataforma."
        },
        "section_10": {
          "title": "10. MODIFICAÇÕES NOS TERMOS",
          "paragraph_1": "O “AgroFast” poderá alterar estes Termos a qualquer momento, visando aprimorar o serviço ou adequá-lo a alterações legais. O usuário será notificado quando alterações relevantes ocorrerem. A continuidade de uso do Aplicativo após a divulgação das alterações significa a aceitação dos novos Termos."
        },
        "section_11": {
          "title": "11. DURAÇÃO E ENCERRAMENTO",
          "paragraph_1": "Estes Termos vigoram por prazo indeterminado, a partir de seu aceite pelo usuário.",
          "paragraph_2": "Qualquer das partes poderá encerrar a relação a qualquer momento, mediante exclusão da conta. Ainda assim, poderão subsistir obrigações decorrentes de fatos ocorridos antes do encerramento."
        },
        "section_12": {
          "title": "12. LEI APLICÁVEL E FORO",
          "paragraph_1": "Estes Termos serão interpretados de acordo com a legislação brasileira.",
          "paragraph_2": "Fica eleito o foro da comarca do domicílio do usuário para dirimir quaisquer disputas decorrentes destes Termos, salvo disposição legal em sentido contrário ou acordo expresso entre as partes."
        },
        "section_13": {
          "title": "13. DISPOSIÇÕES FINAIS",
          "paragraph_1": "A eventual tolerância do “AgroFast” quanto ao descumprimento de quaisquer cláusulas destes Termos não implica renúncia ao direito de exigir o cumprimento em momento posterior.",
          "paragraph_2": "Caso qualquer disposição deste instrumento seja considerada inválida ou inexequível, as demais permanecerão em pleno vigor e efeito.",
          "paragraph_3": "AO UTILIZAR O “AGROFAST”, VOCÊ DECLARA CONHECER E CONCORDAR COM TODOS OS TERMOS ACIMA."
        }
      }
    },
    "PrivacyPolicies": {
      "meta": {
        "title": "Agrofast - Política de Privacidade",
        "description": "Política de Privacidade da Agrofast"
      },
      "content": {
        "main_title": "POLÍTICA DE PRIVACIDADE – APLICATIVO “AGROFAST”",
        "section_1": {
          "title": "1. INFORMAÇÕES GERAIS",
          "paragraph_1": "O “AgroFast” conecta proprietários(as) de máquinas agrícolas a motoristas de caminhão prancha, proporcionando agendamento flexível, negociação de tarifas, rotas otimizadas e outras funcionalidades descritas em nosso Documento de Especificação de Requisitos de Software (DERS). Para fornecer esses serviços de maneira confiável, segura e eficiente, a coleta e o processamento de alguns dados pessoais são indispensáveis."
        },
        "section_2": {
          "title": "2. DADOS COLETADOS",
          "subsections": {
            "subsection_2_1": {
              "subtitle": "2.1. Dados de Cadastro",
              "paragraph_1": "Informações pessoais: nome completo, endereço de e-mail, número de telefone/celular.",
              "paragraph_2": "Credenciais de acesso: login e senha, necessárias para autenticação no aplicativo."
            },
            "subsection_2_2": {
              "subtitle": "2.2. Dados de Perfil",
              "paragraph_1": "Perfil de Motorista: informações sobre o veículo (tipo de caminhão prancha), raio de atendimento, disponibilidade, preferências de transporte e eventuais anexos relativos à habilitação ou licença.",
              "paragraph_2": "Perfil de Proprietário(a): detalhes sobre a(s) máquina(s) agrícola(s) (dimensões, peso aproximado, tipo de equipamento)."
            },
            "subsection_2_3": {
              "subtitle": "2.3. Dados de Localização",
              "paragraph_1": "Localização em tempo real (via GPS) ou localização aproximada do usuário, utilizada para indicar o local exato de retirada/entrega das máquinas, calcular rotas otimizadas e estimar custos."
            },
            "subsection_2_4": {
              "subtitle": "2.4. Dados de Pagamento e Transações",
              "paragraph_1": "Método de pagamento: dados necessários para efetivação da transação (quando houver integração de pagamento).",
              "paragraph_2": "Histórico de transações: valores pagos, datas, horas e detalhes de cada viagem."
            },
            "subsection_2_5": {
              "subtitle": "2.5. Dados de Uso do Aplicativo",
              "paragraph_1": "Solicitações de transporte: registros de cada solicitação (ponto de partida, destino, dimensões/peso das máquinas, data e horário).",
              "paragraph_2": "Mensagens internas: conteúdo das conversas trocadas via sistema de mensagens do aplicativo.",
              "paragraph_3": "Avaliações e feedback: notas e comentários após a conclusão dos serviços."
            },
            "subsection_2_6": {
              "subtitle": "2.6. Dados de Notificações",
              "paragraph_1": "Tokens de notificação, coletados para viabilizar o envio de alertas em tempo real sobre solicitações, status de transporte e pagamentos."
            },
            "subsection_2_7": {
              "subtitle": "2.7. Dados Técnicos",
              "paragraph_1": "Log de erros e métricas de performance, informações do dispositivo (modelo, sistema operacional, versão do app etc.) para diagnóstico e suporte."
            }
          }
        },
        "section_3": {
          "title": "3. FINALIDADES DO TRATAMENTO DOS DADOS",
          "paragraph_1": "Prestação do serviço: viabilizar a conexão entre proprietários(as) e motoristas, possibilitando cadastro, publicação de solicitações, roteirização e cobrança.",
          "paragraph_2": "Segurança: prevenir fraudes, uso indevido do aplicativo e garantir a autenticidade dos acessos.",
          "paragraph_3": "Otimização de rotas e cálculo de tarifas: uso de localização e informações de viagem para estimativas e rotas eficientes.",
          "paragraph_4": "Suporte e mediação de disputas: contato com a equipe de suporte para resolução de problemas e verificação de serviços.",
          "paragraph_5": "Melhorias no serviço: análise de estatísticas, erros e métricas para aprimorar funcionalidades.",
          "paragraph_6": "Comunicação: envio de notificações e atualizações importantes.",
          "paragraph_7": "Cumprimento de obrigações legais: manutenção de registros fiscais e atendimento a solicitações oficiais."
        },
        "section_4": {
          "title": "4. COMPARTILHAMENTO DE DADOS",
          "paragraph_1": "Entre usuários(as): informações básicas para concretizar o transporte (ex.: local de coleta, detalhes do caminhão).",
          "paragraph_2": "Provedores de mapas: a localização e informações de viagem podem ser compartilhadas com APIs de terceiros (Google Maps etc.) para rotas.",
          "paragraph_3": "Provedores de pagamento: dados de cobrança enviados a intermediários financeiros confiáveis.",
          "paragraph_4": "Autoridades competentes: em caso de obrigações legais, decisões judiciais ou investigações."
        },
        "section_5": {
          "title": "5. BASE LEGAL E DIREITOS DOS USUÁRIOS",
          "paragraph_1": "A coleta e o tratamento de dados pessoais se baseiam no consentimento, interesse legítimo e/ou cumprimento de obrigação legal.",
          "paragraph_2": "Nos termos da legislação brasileira (LGPD), os usuários possuem direitos de confirmação de tratamento, acesso, correção, anonimização, bloqueio ou eliminação de dados, portabilidade, revogação de consentimento, entre outros."
        },
        "section_6": {
          "title": "6. RETENÇÃO E EXCLUSÃO DOS DADOS",
          "paragraph_1": "Dados cadastrais mantidos enquanto houver conta ativa. Em caso de exclusão, podem ser retidos para cumprir obrigações legais.",
          "paragraph_2": "Histórico de transações é armazenado para fins de consulta gerencial e auditoria.",
          "paragraph_3": "Mensagens, feedback e avaliações podem ser mantidos para verificação de reputação e mediação de disputas."
        },
        "section_7": {
          "title": "7. MEDIDAS DE SEGURANÇA",
          "paragraph_1": "Criptografia (HTTPS) para proteger informações em trânsito.",
          "paragraph_2": "Armazenamento seguro com controles de acesso físicos e lógicos.",
          "paragraph_3": "Política de senhas fortes e monitoramento de vulnerabilidades."
        },
        "section_8": {
          "title": "8. COOKIES E TECNOLOGIAS SIMILARES",
          "paragraph_1": "Poderão ser utilizadas tecnologias de rastreamento (cookies, identificadores de dispositivo) para melhorar a experiência do usuário, lembrar preferências de idioma e otimizar desempenho."
        },
        "section_9": {
          "title": "9. ATUALIZAÇÕES DA POLÍTICA",
          "paragraph_1": "Esta Política pode ser modificada a qualquer momento para refletir melhorias no serviço ou mudanças legais. Os usuários serão notificados de alterações relevantes."
        },
        "section_10": {
          "title": "10. CONTATO E SUPORTE",
          "paragraph_1": "Dúvidas, solicitações ou reclamações devem ser direcionadas aos canais de suporte no aplicativo ou por e-mail fornecido para esse fim."
        }
      }
     }
  }
}
